rails/app/controllers/expenses_controller.rb

SELECT "expenses".* FROM "expenses"
---
  def index
    expenses = Expense.all

INSERT INTO "expenses" ("name", "value", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "helo "], ["value", 1234], ["created_at", "2017-09-01 13:03:35.201841"], ["updated_at", "2017-09-01 13:03:35.201841"]]
---
  def create
    expense = Expense.create(expense_params)

SELECT  "expenses".* FROM "expenses" WHERE "expenses"."id" = ? LIMIT 1  [["id", 2]]
---
  def show
    expense = Expense.find(params[:id])

SELECT  "expenses".* FROM "expenses" WHERE "expenses"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "expenses" WHERE "expenses"."id" = ?  [["id", 2]]
---
  def destroy
    expense = Expense.find(params[:id])

    if expense.destroy

SELECT  "expenses".* FROM "expenses" WHERE "expenses"."id" = ? LIMIT 1  [["id", 3]]
UPDATE "expenses" SET "name" = ?, "value" = ?, "updated_at" = ? WHERE "expenses"."id" = ?  [["name", "test"], ["value", 2], ["updated_at", "2017-09-02 08:59:09.620711"], ["id", 46]]
---
  def update
    expense = Expense.find(params[:id])

    if expense.update_attributes(expense_params)